In [89]:
import pandas as pd
df = pd.read_excel("Four_Column_Data.xlsx")

In [91]:
print(df)

   ID    Name   Department  Score
0   1   Shyam          NaN    NaN
1   2   Rahul   Biomedical   78.0
2   3   Gopal     Computer   92.0
3   4    Hari   Electrical   88.0
4   5   Karan   Mechanical   74.0
5   6     Ram  Electronics   90.0
6   7  Mayank  Electronics   85.0

In [93]:
df.head(3)

   ID   Name  Department  Score
0   1  Shyam         NaN    NaN
1   2  Rahul  Biomedical   78.0
2   3  Gopal    Computer   92.0

In [95]:
headers = ["S.No", "Student", "Branch", "Obtained_marks"] # Here we have changed the name of the column.
df.columns = headers

In [97]:
df.head(3)

   S.No Student      Branch  Obtained_marks
0     1   Shyam         NaN             NaN
1     2   Rahul  Biomedical            78.0
2     3   Gopal    Computer            92.0

In [99]:
df["Obtained_marks"] = df["Obtained_marks"] + 2 # We are increasing the obtained marks of each student by 2.

In [101]:
df.head(3)

   S.No Student      Branch  Obtained_marks
0     1   Shyam         NaN             NaN
1     2   Rahul  Biomedical            80.0
2     3   Gopal    Computer            94.0

In [111]:
df.drop([0], axis=0) # So here we can see the first row has been deleted. If we want to delete column we can use the axis = 1.

   S.No Student       Branch  Obtained_marks
1     2   Rahul   Biomedical            80.0
2     3   Gopal     Computer            94.0
3     4    Hari   Electrical            90.0
4     5   Karan   Mechanical            76.0
5     6     Ram  Electronics            92.0
6     7  Mayank  Electronics            87.0

In [113]:
import numpy as np

In [117]:
df["Obtained_marks"]=replace(np.87.0, 89)

SyntaxError: invalid syntax. Perhaps you forgot a comma? (849320974.py, line 1)